-- MySQL dump 10.13  Distrib 8.0.13, for Linux (x86_64)
--
-- Host: localhost    Database: lesson6
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `PRODUCT`
--

DROP TABLE IF EXISTS `PRODUCT`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `PRODUCT` (
  `ID` bigint(20) NOT NULL,
  `PRODUCT_NAME` varchar(20) NOT NULL,
  `PRICE` decimal(19,2) DEFAULT NULL,
  `STOCK` decimal(19,2) DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `PRODUCT`
--

LOCK TABLES `PRODUCT` WRITE;
/*!40000 ALTER TABLE `PRODUCT` DISABLE KEYS */;
INSERT INTO `PRODUCT` VALUES (2,'sk2神仙水',1200.00,NULL),(4,'玻尿酸大 278',278.00,0.00),(5,'白檀 1400',1400.00,0.00),(9,'sk套装',570.00,NULL),(10,'玻尿酸小 44',44.00,0.00),(11,'shiro 香草',300.00,NULL),(12,'shiro 芍药 ',280.00,NULL),(13,'大福草莓 50',50.00,0.00),(14,'大福哈密瓜 50',50.00,0.00),(15,'pocky 草莓',30.00,NULL),(16,'pocky哈密瓜 ',78.00,NULL),(17,'北海道草莓饼干 60',60.00,NULL),(18,'北海道大福 78',78.00,0.00),(19,'KitKat草莓味 ',38.00,NULL),(20,'札幌农学院 98',98.00,NULL),(21,'艾杜纱睫毛打底 80',80.00,0.00),(22,'优衣库发热衣 168',168.00,NULL),(23,'优衣库发热裤 168',168.00,NULL),(24,'优衣库发热衣裤 330',330.00,NULL),(25,'倩丽 102 50',50.00,NULL),(26,'倩丽 402 50',50.00,NULL),(27,'一三共洗面奶 158',158.00,NULL),(28,'芙丽芳丝水乳 428',428.00,0.00),(29,'脂流茶 88',88.00,NULL),(30,'pitta 口罩 48',48.00,NULL),(31,'桃子水 88',88.00,NULL),(32,'小粉丸 98',98.00,NULL),(33,'BOTA身体乳 110',110.00,NULL),(34,'熊野职人睫毛膏 140',140.00,NULL),(35,'kate眉粉 88',88.00,NULL),(36,'砍妹 腮红 78',78.00,NULL),(37,'资生堂洗粉扑  38',38.00,NULL),(38,'uno男士面霜 90',90.00,0.00),(39,'uno男士洗面奶 50',50.00,0.00),(40,'染发剂 75',75.00,NULL),(41,'发膜 100',100.00,NULL),(42,'去渍笔 35',35.00,NULL),(43,'小狮子水杯 330',330.00,NULL),(44,'8元唇膏 8',8.00,0.00),(45,'资生堂专科洗面奶 48',48.00,NULL),(46,'珂润洗面奶 98',98.00,NULL),(47,'娃娃咬咬*2 150',150.00,NULL),(48,'珂润唇膏 85',85.00,NULL),(49,'蓬蓬粉 140',140.00,NULL),(50,'花王护手霜 50',50.00,NULL),(51,'溃疡贴 79',79.00,NULL),(52,'大米面膜 78',78.00,0.00),(53,'草莓pocky 30',30.00,0.00),(54,'手摇铃 85',85.00,NULL),(55,'佑天兰 55',55.00,NULL),(56,'惠之本铺 138',138.00,NULL),(57,'太田胃散 32包 70',70.00,NULL),(58,'太田胃散 48包 90',90.00,NULL),(59,'onaka 188',188.00,NULL),(60,'大木复合维生素 138',138.00,NULL),(61,'怡丽丝尔睡眠面膜 240',240.00,NULL),(62,'下水道疏通丸    30',30.00,NULL),(63,'珂润面霜 148',148.00,NULL),(64,'洗内裤 ',35.00,NULL),(65,'pdc面膜 140',140.00,NULL),(66,'肌美精 3d 60',60.00,NULL),(67,'老人头膏药 78',78.00,NULL),(68,'柚子卸妆 500ml 288',288.00,NULL),(69,'baby香水 90',90.00,NULL),(70,'珂润水乳 240',240.00,NULL),(71,'太田胃散 16包 50',50.00,NULL),(72,'蒸汽眼罩 88',88.00,NULL),(73,'青汁 70',70.00,NULL),(74,'根菜面膜 78',78.00,NULL),(75,'G眼药水 128',128.00,NULL),(76,'凡尔赛 30',30.00,NULL),(77,'倩丽隔离 70',70.00,NULL),(78,'酵素 Gol 238',238.00,NULL),(79,'野口纳豆 248',248.00,NULL),(80,'怡丽丝尔 银色防晒 238',238.00,NULL),(81,'倩丽腮红 48',48.00,NULL),(82,'薏仁丸 44',44.00,NULL),(83,'瘦腿丸 64',64.00,NULL),(84,'感冒药 150',150.00,NULL),(85,'pc眼药水 68',68.00,NULL),(86,'暖宝宝 22',22.00,NULL),(87,'资生堂唇膏 78',78.00,NULL),(88,'dhc唇膏 48',48.00,NULL),(89,'黛珂高机能水 640',640.00,NULL),(90,'covermark 350',350.00,NULL),(91,'ysl细管 278',278.00,3.00),(92,'hr眼霜 658',658.00,NULL),(93,'cpb长管隔离 410',410.00,NULL),(94,'cpb洗面奶滋润 350',350.00,NULL),(95,'茵芙莎水 300',300.00,NULL),(96,'茵芙莎水乳 ex系列 730',730.00,NULL),(97,'茵芙莎蓝瘦子 318',318.00,NULL),(98,'茵芙莎三色遮瑕 248',248.00,NULL),(99,'资生堂悦薇水乳 1200',1200.00,NULL),(100,'资生堂小钢炮眼霜 448',448.00,NULL),(101,'迪奥的凝脂恒久保湿粉饼 458',458.00,NULL),(102,'Dior红管 268',268.00,NULL),(103,'mamakids cream 138',138.00,NULL),(104,'TAKIMI ',330.00,NULL),(105,'红腰子 50ml 850',850.00,NULL),(106,'资生堂 激能眼霜 330',330.00,NULL),(107,'lp 粉底霜 1650',1650.00,NULL),(108,'久光贴 98',98.00,NULL),(109,'Gucci  围巾 4300',4300.00,NULL),(110,'宝宝牙刷 ',18.00,NULL),(111,'宝宝牙膏',28.00,NULL),(115,'黛珂散粉 350',350.00,NULL),(122,'尤妮佳化妆棉 18',18.00,NULL),(123,'玉肌洗发露 220',220.00,NULL),(129,'紫苏牛油 150ml 648',648.00,NULL),(130,'紫苏牛油300ml 966',966.00,NULL),(136,'红腰子 100ml 1048',1048.00,NULL),(140,'波比布朗 猪五花 240',240.00,0.00),(143,'AE 375',375.00,NULL),(149,'兰蔻日本版小黑瓶 1360',1360.00,NULL),(153,'tf80 338',338.00,0.00),(154,'洛丽塔护发油 178',178.00,NULL),(172,'cpb洗面奶清爽 350',350.00,0.00),(188,'雅诗兰黛沁水粉底液 425',425.00,NULL),(191,'黛珂隔离 238',238.00,NULL),(192,'雅诗兰黛眼霜 375',375.00,NULL),(207,'eva白兔止疼药 20片 强效 70',70.00,NULL),(215,'十全大补面膜 340',340.00,NULL),(262,'科颜氏淡斑精华 563',563.00,NULL),(270,'科颜氏高保湿 125ml 398',398.00,NULL),(271,'科颜氏高保湿 50ml 258',258.00,NULL),(272,'suqqu四色眼影',480.00,NULL),(273,'suqqu腮红 ',420.00,NULL),(274,'suqqu防晒 sp50 套 ',760.00,NULL),(282,'sk2 小灯泡',1370.00,NULL),(285,'小粉丸 一板 15',15.00,NULL),(296,'御守 78',78.00,NULL),(305,'兰蔻粉水 358',358.00,NULL),(315,'envie隐形眼镜10片 138',138.00,NULL),(326,'膳魔师限定保温杯 230',230.00,NULL),(342,'黛珂精致洁面 套 1250',1250.00,NULL),(359,'资生堂悦薇眼霜 768',768.00,NULL),(362,'fancl30代 30日分 女 158',158.00,NULL),(363,'fancl30代 30日分 男 158',158.00,NULL),(374,'letao 草莓巧克力 80',80.00,NULL),(375,'fx 银 48',48.00,NULL),(376,'fx 金 60',60.00,NULL),(378,'砍妹 棉花糖粉饼 80',80.00,NULL),(379,'乐敦美少女眼药水 特价 30',30.00,18.00),(398,'兰蔻小黑瓶眼霜 360',360.00,NULL),(399,'兰蔻小黑瓶精华眼霜 480',480.00,NULL),(400,'纪梵希散粉 455',455.00,NULL),(423,'森永太妃糖 ',26.00,NULL),(440,'我的美丽日记高保湿 80',80.00,NULL),(441,'婴儿面膜 64',64.00,NULL),(447,'布艺消毒 35',35.00,NULL),(449,'红石榴水日晚霜套装',1120.00,NULL),(450,'ALLIE防晒',158.00,NULL),(459,'面包超人药水',88.00,NULL),(503,'艾杜纱bb超保湿唇膏 ',88.00,NULL),(512,'ipsa清洁面膜',288.00,NULL),(514,'白桃乌龙极品 袋 ',138.00,NULL),(515,'白桃乌龙 罐 ',98.00,NULL),(524,'止汗石',68.00,NULL),(525,'悦薇劲霜',290.00,9.00),(526,'KitKat',28.00,NULL),(528,'suisai收敛水',180.00,NULL),(530,'熊野职人眼线笔',122.00,NULL),(531,'睫毛夹',35.00,NULL),(533,'资生堂红腰子 30ml',548.00,NULL),(534,'资生堂红腰子 50ml',800.00,NULL),(540,'狮王祛痘 14g',70.00,NULL),(541,'狮王祛痘 24g',105.00,NULL),(542,'晕车药 9颗',98.00,NULL),(543,'大板刷',28.00,NULL),(545,'怡丽丝尔睡眠面膜 保湿',210.00,NULL),(546,'婴幼儿指甲刀',75.00,NULL),(547,'龙角散',58.00,NULL),(549,'EVE 普通 24颗',58.00,NULL),(550,'EVE 普通 48颗',62.00,NULL),(551,'EVE 普通 60颗',72.00,NULL),(552,'EVE EX 20颗',60.00,NULL),(553,'EVE EX 40颗',98.00,NULL),(554,'EVE QUICK 20颗',94.00,NULL),(555,'EVE QUICK 40颗',140.00,NULL),(556,'EVE QUICK DX 20颗',108.00,NULL),(557,'EVE QUICK DX 40颗',168.00,NULL),(558,'white cone',130.00,NULL),(570,'华歌尔 ',255.00,NULL),(573,'澳尔滨卸妆棉',38.00,NULL),(578,'白色恋人 12枚',80.00,NULL),(579,'砍妹眼影',78.00,NULL),(580,'砍妹单色腮红',65.00,NULL),(581,'dior镜光唇釉',258.00,NULL),(582,'dior 黑管唇膏',268.00,NULL),(584,'fancl 胶原蛋白水乳',290.00,NULL),(589,'珂润卸妆',88.00,NULL),(596,'hr 小绿瓶 套装',2350.00,NULL),(608,'suqqu粉霜',658.00,NULL),(613,'眉毛雨衣',48.00,NULL),(615,'棉条',88.00,NULL);
/*!40000 ALTER TABLE `PRODUCT` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-01-10  8:06:42
